# python Input 和 Output
"""
·························································总结····························································
1. print("hi") 语句执行完后自动换行
2. name = input("please input your information:")执行时，在终端输出 input("")双引号中的字符串并换行，将用户输入的字符读取并赋值给name
························································································································
"""

# 几种输出类型
print("hi!")
print("hi!", "tukee.")
print("今天的气温是", 26, "摄氏度。")

"""
······输出展示·······
hi!
hi! tukee.
今天的气温是 26 摄氏度。
...................
"""

# 输入
name = input("请输入您的名字:")
print("hi!", name)

"""
······输出展示·····
请输入您的名字:tukee
hi! tukee
·················
"""